[
  {
    "deal": {
      "product_description": "The Samsung Galaxy Watch Ultra is a premium 47mm LTE Titanium smartwatch designed for both style and functionality. It features a circular display made with durable materials suitable for outdoor activities, providing GPS tracking, health monitoring, and custom apps for various needs. The robust design integrates a range of smart features including notifications, music control, and heart rate tracking, making it an ideal companion for fitness enthusiasts and tech-savvy users alike.",
      "price": 350.0,
      "url": "https://www.dealnews.com/Samsung-Galaxy-Watch-Ultra-47-mm-LTE-Titanium-Smartwatch-up-to-350-off-w-Trade-in-free-shipping/21663266.html?iref=rss-c142"
    },
    "estimate": 773.8138460593241,
    "discount": 423.8138460593241
  },
  {
    "deal": {
      "product_description": "The Refurbished Unlocked Apple iPhone 14 Pro Max offers an impressive 256GB storage and a huge display, perfect for both media consumption and productivity. Enjoy advanced camera technology for stunning photos. This model is designed to provide a seamless user experience with 5G capabilities for faster downloads and streaming. Refurbished to high standards, it comes in various colors and can support all the latest apps from the App Store, accommodating any Apple enthusiast's needs.",
      "price": 705.0,
      "url": "https://www.dealnews.com/products/Apple/Unlocked-Apple-iPhone-14-Pro-Max-256-GB-Smartphone/462808.html?iref=rss-c142"
    },
    "estimate": 930.8824204895075,
    "discount": 225.88242048950747
  },
  {
    "deal": {
      "product_description": "The Eco-Worthy 20.48kWh 48V 100AH Server Rack Lithium Battery comes as a 4-pack, integrated with a Solar Hybrid Inverter, offering a robust solution for significant energy storage. This comprehensive system features wireless connectivity and smart monitoring, allowing users to conveniently manage and track its performance. Designed for durability, the batteries boast an impressive 6,000 deep discharge cycles, ensuring a long operational lifespan. The entire unit is engineered to fit seamlessly into standard 3U cabinets, making it suitable for professional and home energy setups. Additionally, the included 5,000-watt hybrid inverter provides UPS functionality, supporting four distinct charging modes and three output modes for versatile power management.",
      "price": 3800.0,
      "url": "https://www.dealnews.com/Eco-Worthy-20-48-k-Wh-48-V-100-AH-Server-Rack-Lithium-Battery-4-Pack-with-Solar-Hybrid-Inverter-for-3-800-free-shipping/21748988.html?iref=rss-c142"
    },
    "estimate": 5455.758953877536,
    "discount": 1655.7589538775364
  },
  {
    "deal": {
      "product_description": "This comprehensive power solution includes four 20.48kWh 48V 100AH server rack lithium batteries, providing substantial energy storage. It comes with a 5,000-watt hybrid inverter, which also features UPS functionality for uninterrupted power supply. The system offers wireless connectivity and smart monitoring capabilities for convenient oversight. Designed for durability, the batteries boast 6,000 deep discharge cycles and are suitable for standard 3U cabinet installations. The inverter supports four distinct charging modes and three output modes, ensuring versatile energy management.",
      "price": 3800.0,
      "url": "https://www.dealnews.com/Eco-Worthy-20-48-k-Wh-48-V-100-AH-Server-Rack-Lithium-Battery-4-Pack-with-Solar-Hybrid-Inverter-for-3-800-free-shipping/21748988.html?iref=rss-c142"
    },
    "estimate": 5304.955484243061,
    "discount": 1504.9554842430607
  },
  {
    "deal": {
      "product_description": "This is a certified refurbished iRobot Roomba j9+ robot, designed for comprehensive floor cleaning by combining vacuuming and mopping functionalities. It features a Clean Base that automatically empties debris from the vacuum and refills the water or cleaning solution for the mop, allowing for up to 30 days of hands-free cleaning. The device boasts a fully retractable mop function, ensuring carpets remain dry while only hard floors are mopped. Its 4-stage cleaning system efficiently tackles dirt, dust, and debris. This smart cleaning appliance is identified by model C975020.",
      "price": 331.0,
      "url": "https://www.dealnews.com/products/iRobot/iRobot-Roomba-j9-Self-Emptying-Auto-Fill-Robot-Vacuum-Mop/489623.html?iref=rss-f1912"
    },
    "estimate": 603.8118221984015,
    "discount": 272.8118221984015
  },
  {
    "deal": {
      "product_description": "The Sonos Era 100 is a powerful smart speaker designed to deliver optimized audio in any space. It supports versatile connectivity options, including Bluetooth, Wi-Fi, and USB, allowing for flexible audio streaming from various sources. Integrated with Alexa, the speaker offers convenient voice control for various functions, enhancing user interaction. A notable feature is its Trueplay tuning technology, accessible via the Sonos app, which intelligently analyzes the unique acoustics of a room to calibrate and optimize the speaker's equalization for the best sound quality.",
      "price": 119.0,
      "url": "https://www.dealnews.com/products/Sonos/Sonos-Era-100-Bluetooth-Smart-Speaker/488007.html?iref=rss-f1912"
    },
    "estimate": 363.23856581229313,
    "discount": 244.23856581229313
  },
  {
    "deal": {
      "product_description": "This is a robust portable power solution combining the Jackery 3000 Pro power station with two 200W solar panels. The power station boasts a substantial 3024Wh capacity and delivers a powerful 3000W output, capable of running a wide range of appliances. It features rapid charging, reaching full capacity in just 2.4 hours, ideal for quick turnarounds. The unit includes two PD 100W ports for versatile charging options. This comprehensive portable power system is identified by model number JE-3000A, providing reliable energy off-grid or during outages.",
      "price": 1899.0,
      "url": "https://www.dealnews.com/products/Jackery/Jackery-3000-Pro-3-024-Wh-Portable-Power-Station-200-W-Solar-Panel-2-Pack/485082.html?iref=rss-c196"
    },
    "estimate": 2422.0261286820805,
    "discount": 523.0261286820805
  },
  {
    "deal": {
      "product_description": "This HP Victus laptop is a high-performance machine designed for demanding tasks and gaming. It features an AMD Ryzen 7 7445HS 3.1GHz 8-core CPU, providing powerful processing capabilities. Equipped with 16GB of RAM and a 512GB SSD, it offers ample memory and fast storage for quick boot times and application loading. The 15.6-inch IPS display delivers crisp 1920x1080 (1080p) resolution, ideal for immersive visuals. Graphics are powered by an NVIDIA GeForce RTX 4050 with 6GB of dedicated memory, ensuring smooth gameplay and efficient handling of graphic-intensive applications, all running on Windows 11 Home.",
      "price": 650.0,
      "url": "https://www.dealnews.com/products/HP/HP-Victus-Ryzen-7-15-6-Laptop-w-NVIDIA-Ge-Force-RTX-4050/491498.html?iref=rss-c39"
    },
    "estimate": 942.9111097102766,
    "discount": 292.9111097102766
  },
  {
    "deal": {
      "product_description": "The Sunseeker V3 is a wireless robot lawn mower designed to efficiently maintain lawns up to 6,400 sq. ft. This advanced device utilizes Vision AI technology, enabling it to navigate and avoid obstacles on your property with precision. It is capable of handling slopes up to 42%, making it suitable for varied terrains. The mower operates quietly, providing a pet-friendly experience. Full control and over-the-air updates are managed through a dedicated app, providing convenience and ensuring the mower stays current with the latest features.",
      "price": 799.0,
      "url": "https://www.dealnews.com/Sunseeker-V3-Wireless-Robot-Lawn-Mower-for-799-free-shipping/21751109.html?iref=rss-c196"
    },
    "estimate": 2051.2005397703747,
    "discount": 1252.2005397703747
  }
]